store_api/app/controllers/v1/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "store_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      @product = @store.products.new(product_params)
      if @product.valid?
        @product.save

UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "Test"], ["updated_at", "2021-06-18 08:18:59.668982"], ["id", 1]]
---
    def update
      if @product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."store_id" = $1 AND "products"."deleted_at" IS NOT NULL AND "products"."id" = $2 LIMIT $3  [["store_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "deleted_at" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["deleted_at", nil], ["updated_at", "2021-06-18 19:57:49.836770"], ["id", 1]]
---
    def restore
      @product = @store.products.only_deleted.find_by(id: params[:product_id])
      head :not_found unless @product
      Product.restore @product.id

SELECT "products".* FROM "products" WHERE "products"."deleted_at" IS NULL AND "products"."store_id" = $1 AND "products"."id" = $2 LIMIT $3  [["store_id", 7], ["id", 3], ["LIMIT", 1]]
---
    def set_product
      @product = @store.products.find_by(id: params[:id])