store_api/app/controllers/v1/users_controller.rb

INSERT INTO "users" ("email", "age", "password_digest", "type", "created_at", "updated_at", "store_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "tokens" ("user_id", "token", "expires_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
      @user = Owner.new(user_params)
      if @user.valid?
        @user.save
        @token = @user.tokens.create

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "majorie@ebert.co"], ["LIMIT", 1]]
INSERT INTO "tokens" ("user_id", "token", "expires_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def login
      @user = User.find_by(email: login_params[:email])
      if @user.present? && @user.authenticate(login_params[:password])
        @token = @user.tokens.create